<template>
  <div class="container">
    <h1>Главная</h1>
    <div class="flex-container">
      <p class="text">
        Как говорят в народе: "У природы нет плохой погоды". Каждая пора года
        приносит нам свою уникальную погоду, которая соответствует всем нормам
        нашего климата. Конечно, всем хочется солнышка и теплого уюта, но к нам
        часто приходят и нежелательные осадки. Нам повезло, потому что наша
        Родина размещается в наиболее благоприятной климатической зоне. У нас
        есть все четыре времени года: весна, зима, лето и осень. Нам зимой
        иногда хочется поехать в теплые края и погреться на солнышке. Но хотели
        бы мы в течение целого года жить в таком горячем климате. Наверное, что
        нет. Каждая пора года имеет свою хорошую погоду, которая постоянно
        меняется. Зимой мы встречаемся с морозом и снегом, которого так долго
        ждем осенью. Весна каждому человеку дарит вдохновение и приятные эмоции.
      </p>
    </div>
  </div>
</template>

<script>
import { mapGetters } from "vuex";
export default {
  name: "IndexPage",
  computed: {
    ...mapGetters({
      widget: "widget",
    }),
  },
};
</script>

<style>
h1 {
  margin-bottom: 30px;
}
.flex-container {
  display: flex;
  justify-content: space-between;
  gap: 80px;
}
</style>
